Revit 2024 API
ExportLayerInfo.ClearLayerModifiers Method
 Clears all the project layer modifiers stored in the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void ClearLayerModifiers()
Visual Basic
Public Sub ClearLayerModifiers
Visual C++
public:
void ClearLayerModifiers()
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace